2018/estimating-revisited.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-24 Tue 09:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Revisiting - Estimating</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>John's Draft Blog | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">Revisiting - Estimating</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org66d0e7a">Post 1 - Breaking away from time based estimating</a></li>
<li><a href="#orga4c5629">Post 2 - Scrum estimating experiences</a></li>
<li><a href="#orgea42f29">Estimating is not about forecasting</a></li>
<li><a href="#orgda152a0">Metrics can be gamed</a></li>
<li><a href="#org0ed60f7">Summary</a></li>
</ul>
</div>
</div>
<p>
I have been looking forward to revisiting some of my old blog posts for some
time. I wanted to see how my thinking has changed since first writing them. Over the weekend, a
colleague told me that he had read my posts on estimating and found them very
interesting. I took this prompt to revisit them.
</p>

<p>
My thoughts on estimating have changed a lot and experience has led me to
think very differently about the value of estimating.
</p>

<div id="outline-container-org66d0e7a" class="outline-2">
<h2 id="org66d0e7a">Post 1 - Breaking away from time based estimating</h2>
<div class="outline-text-2" id="text-org66d0e7a">
<p>
The original post can be found here:
<a href="http://www.jsolutions.co.uk/2012/breakingtimebased.html">Post 1</a>
</p>

<p>
The first article looks at how estimating using units of time is not a good
means of estimating the effort required for a team to complete a set of tasks.
</p>

<p>
It attempted to demonstrate that using abstract units - story points - to estimate
resulted in a very similar forecast of the time to complete with less effort and
little need to change estimates based on who was working on the task.
The article highlighted that forecasting in Scrum is through an adaptive,
historical measure of progress of the whole team, rather than the sum of
predictive measures of individuals within the team.
</p>

<p>
It also highlighted that velocity could be used as a metric of improvement: As
the team gets more efficient, one would expect velocity to go up.
</p>
</div>
</div>

<div id="outline-container-orga4c5629" class="outline-2">
<h2 id="orga4c5629">Post 2 - Scrum estimating experiences</h2>
<div class="outline-text-2" id="text-orga4c5629">
<p>
The original post can be found here:
<a href="http://www.jsolutions.co.uk/2011/scrumestimatingexp.html">Post 2</a>
</p>

<p>
In the second post, I wrote about 3 different teams and the different
challenges the teams face when estimating.
</p>

<p>
The article highlighted what I believed to be important goals of estimating:
</p>

<ul class="org-ul">
<li>Calculate the relative effort required to complete a story.</li>
<li>Measure the velocity of development.</li>
<li>Manage roadmaps using velocity, resource capacity and backlog size.</li>
<li>Manage product releases.</li>
</ul>

<p>
"Ultimately we are trying to achieve the predictable release of the product, by
managing our expectation that is based on velocity and the relative size of
features."
</p>
</div>
</div>

<div id="outline-container-orgea42f29" class="outline-2">
<h2 id="orgea42f29">Estimating is not about forecasting</h2>
<div class="outline-text-2" id="text-orgea42f29">
<p>
Estimating is not about forecasting? This goes against what many of us see as
the prime purpose of estimating. I certainly believed that to be the case as can
be seen in both my posts.
</p>

<p>
A forecast is only valid if nothing, or very little, changes between now and
completion. However, the complex nature of the problems we are trying to solve
means we have high levels of unknown and lots to learn on our
journey towards delivering real end user value. Using estimates as forecasts is
assuming that any learning is of less value than our current
understanding. This is rareley the case and we should assume the opposite -
learning is of more value than our current understanding.
</p>

<p>
My original thinking assumed that roadmaps and releases were planned and set
with little adaptation along the way. Was I valuing following a plan over
adapting to change?
</p>

<p>
So if estimates are not for forecasting, what are they for?
</p>

<p>
The reason for estimates within an agile team is not about the estimated size of
the task. It is the discussion as to WHY it is of a certain size that holds the
value in estimating.
</p>

<p>
Discussing estimates, or more importantly what's involved in getting a task
done, provides an opportunity for shared understanding that shared documentation
can rarely accomplish, let alone a single story point figure.
</p>

<p>
Often there really is no benefit in even recording the story points against a
story, as the #noestimates movement espouses. The discussion and consensus is
important, but the value arrived at ralrely is. 
</p>

<p>
<b>Challenge: What would be the result of your team dropping story points?</b>
</p>
</div>
</div>

<div id="outline-container-orgda152a0" class="outline-2">
<h2 id="orgda152a0">Metrics can be gamed</h2>
<div class="outline-text-2" id="text-orgda152a0">
<p>
I mentioned in the first post that velocity is a metric that can be used to show
improvements: As the team get more efficient, velocity goes up.
</p>

<p>
This can clearly be gamed by the team should they want to. A subtle increase in
story point estimates will appear to make the team appear more efficient, when
really nothing is changing.
</p>

<p>
Using an issue count as a velocity, rather than story points can also be gamed,
in an interesting way. If issue count is the metric used, then the only way to
game the metric is to make issues smaller. This has the side effect of reducing
work in progress by making batch sizes smaller. Gaming metrics does not always have to
be negative, the choice of metrics can be used to encourage positive side effects.
</p>

<p>
<b>Challenge: How can you encourage positive side effects from the way you
estimate?</b>
</p>
</div>
</div>

<div id="outline-container-org0ed60f7" class="outline-2">
<h2 id="org0ed60f7">Summary</h2>
<div class="outline-text-2" id="text-org0ed60f7">
<p>
In this post, I have highlighted why treating estimates as a means to
forecasting goes against the agile value of adapting to change and assumes new
learning to be less important than current understanding. 
</p>

<p>
Story points are still useful and can be used by the team to measure its
efficiency but can easily be gamed to distort results, especially if the metric
is used by people external to the team, to measure the teams effectiveness.
</p>

<p>
I'm sure my thinking will change again, as it has done since first writing the
posts, but in ways that I don't yet know. I am not going to assume that my
current understanding is of more value than what can be learned in the future.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Cumming</p>
<p class="date">Created: 2018-07-24 Tue 09:28</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
